In [25]:
import sqlite3
import pandas as pd

# Connect to the database
conn = sqlite3.connect("database2.db")

# Load devices table
devices_df = pd.read_sql_query("SELECT * FROM devices", conn)
devices_df

   switch_id            name      location      device_type  max_power_rating
0      ac_01             AC1       Bedroom               AC            2800.0
1      ac_02             AC2   Living Room               AC            2500.0
2      ac_03             AC3       Kitchen               AC            2800.0
3      mw_01       Microwave       Kitchen        Microwave            1600.0
4      rf_01    Refrigerator       Kitchen     Refrigerator             500.0
5      dw_01      Dishwasher       Kitchen       Dishwasher            2400.0
6      sp_01      SmartPlug1   Living Room       Smart Plug             180.0
7      wm_01  WashingMachine  Laundry Room  Washing Machine            2000.0
8      tv_01              TV   Living Room               TV             120.0
9      lt_01          Light1   Living Room            Light              60.0
10     lt_02          Light2       Kitchen            Light              60.0
11     lt_03          Light3       Bedroom            Light              60.0
12     lt_04          Light4      Bathroom            Light              60.0
13     lt_05          Light5        Office            Light              50.0
14     lt_06          Light6        Garage            Light              70.0

In [26]:
# Load historical energy readings
historical_df = pd.read_sql_query("SELECT * FROM historical_energy_readings", conn)
historical_df["timestamp"] = pd.to_datetime(historical_df["timestamp"])
historical_df

     switch_id           timestamp  power_consumption
0        dw_01 2025-04-17 11:44:42            1256.34
1        mw_01 2025-04-17 11:44:42             999.62
2        rf_01 2025-04-17 11:44:42             125.47
3        ac_02 2025-04-17 11:44:42             437.80
4        tv_01 2025-04-17 11:44:42              96.37
...        ...                 ...                ...
2916     sp_01 2025-04-24 11:44:42              69.93
2917     wm_01 2025-04-24 11:44:42             784.63
2918     lt_04 2025-04-24 11:44:42              90.17
2919     ac_02 2025-04-24 11:44:42             691.25
2920     lt_01 2025-04-24 11:44:42              71.99

[2921 rows x 3 columns]

In [27]:
# # Load real-time energy readings
realtime_df = pd.read_sql_query("SELECT * FROM real_time_energy_readings", conn)
realtime_df["timestamp"] = pd.to_datetime(realtime_df["timestamp"])

realtime_df

     switch_id           timestamp  power_consumption
0        lt_06 2025-04-24 11:44:39              12.27
1        lt_03 2025-04-24 11:44:39              93.63
2        lt_01 2025-04-24 11:44:39              77.47
3        ac_03 2025-04-24 11:44:39             509.70
4        mw_01 2025-04-24 11:44:39            1164.72
...        ...                 ...                ...
5141     lt_02 2025-04-24 21:44:39              27.70
5142     ac_01 2025-04-24 21:44:39             317.95
5143     tv_01 2025-04-24 21:44:39             142.01
5144     lt_04 2025-04-24 21:44:39              24.08
5145     ac_03 2025-04-24 21:44:39             612.72

[5146 rows x 3 columns]

In [28]:
predictions_df = pd.read_sql_query("SELECT * FROM predictions", conn)
predictions_df["timestamp"] = pd.to_datetime(predictions_df["timestamp"])
predictions_df

               timestamp  power_consumption
0    2025-04-24 21:49:42        3149.285986
1    2025-04-24 21:54:42        2490.527105
2    2025-04-24 21:59:42        3272.578259
3    2025-04-24 22:04:42        3099.407496
4    2025-04-24 22:09:42        2990.984688
...                  ...                ...
1891 2025-05-01 11:24:42        3446.580964
1892 2025-05-01 11:29:42        2663.972560
1893 2025-05-01 11:34:42        3110.615445
1894 2025-05-01 11:39:42        2778.564258
1895 2025-05-01 11:44:42        2806.870813

[1896 rows x 2 columns]

In [29]:
# Load scheduled tasks table
scheduled_tasks_df = pd.read_sql_query("SELECT * FROM scheduled_tasks", conn)
scheduled_tasks_df["scheduled_time"] = pd.to_datetime(scheduled_tasks_df["scheduled_time"], errors='coerce')  # Handle any nulls in 'scheduled_time'
scheduled_tasks_df

Empty DataFrame
Columns: [task_id, switch_id, target_date, scheduled_time, status]
Index: []

In [30]:
conn.close()